# Семинар №3 
## Задача 1
Дан список чисел. Определите, сколько в нем встречается различных чисел.

### Решение 
### Код
```py
list_1=list()

k=int(input("Введите сколько будет чисел "))

for i in range(k):
    list_1.append(int(input()))

a=set(list_1)

print(f"Кол-во различных числе : {len(a)}")
```

## Задача 2
Дана последовательность из N целых чисел и число
К. 
Необходимо сдвинуть всю последовательность (сдвиг - циклический) на К элементов 
вправо, К - положительное число.

### Решение
### Код
```py
list_1=list()

m=int(input("Введите кол-во чисел "))

for i in range(m):
    list_1.append(int(input()))

print(list_1)

K=int(input("На сколько сдвинуть "))
N=len(list_1)


# Если список пуст, просто выводим его
if N == 0:
    print(arr)
else:
    # Нормализуем K (убираем лишние полные обороты)
    K = K % N

    # Создаём новый список той же длины, заполненный нулями
    result = [0] * N

    # Заполняем новый список со сдвигом
    for i in range(N):
        new_index = (i + K) % N   # позиция после сдвига вправо
        result[new_index] = list_1[i]

    # Выводим результат
    print(result)
```

## Задача 3 

Напишите программу для печати всех уникальных значений в словаре.

### Решение 
### Код
```py
a=dict()

k=int(input("Кол-во элементов в массиве "))
for i in range(k):
    a[input()]=input()

print(a)

key=list()

attribute=list()

for item in a :
    key.append(item)
    attribute.append(a[item])

b=set(attribute)
print(b)
```

## Задача 4

Дан массив, состоящий из целых чисел. 
Напишите программу, которая подсчитает количество элементов массива, 
больших предыдущего (элемента с предыдущим номером)

### Решение 
### Код 
```py
list_1=list()

k=int(input("Сколько элементов "))

for i in range(k):
    list_1.append(int(input()))

print(list_1)
count=0
for i in range(1, len(list_1)):
    if list_1[i] > list_1[i-1]:
        count += 1

print(count)
```

# Домашняя работа

Требуется вычислить, сколько раз встречается некоторое число Х в массиве A[1..N].
 Пользователь в первой строке вводит натуральное число 
 N - количество элементов в массиве. В последующих строках записаны N целых чисел А. 
 Последняя строка содержит число X

 ### Решение 
 ### Код
 ```py
 list_1=list()

k=int(input())

for i in range(k):
    list_1.append(int(input()))

X=int(input())
count=0
for i in range(1,len(list_1)+1):
    if(list_1[i-1]==X):
        count+=1

print(count)
```

## Задача 2

Требуется найти в массиве A[1..N] самый близкий по величине элемент 
к заданному числу Х. Пользователь в первой строке вводит натуральное число 
N - количество элементов в массиве. В последующих строках записаны N целых чисел А. 
Последняя строка содержит число Х

### Решение 
### Код
```py
# Ввод данных
N = int(input("Введите количество элементов: "))
arr = []
for i in range(N):
    arr.append(int(input("Введите элемент: ")))

X = int(input("Введите число X: "))

# Поиск ближайшего элемента
best_element = arr[0]
min_diff = abs(arr[0] - X)

for i in range(1, N):
    current_diff = abs(arr[i] - X)
    if current_diff < min_diff:
        min_diff = current_diff
        best_element = arr[i]

# Вывод результата
print("Самый близкий элемент:", best_element)
```