# Семинар №6. Повторение списков 

## Задача 1 

Даны два массива чисел. Требуется вывести те элементы первого массива 
(в том порядке, в каком они идут в первом массиве), 
которых нет во втором массиве. 
Пользователь вводит число N - количество элементов в первом массиве, 
затем N чисел - элементы массива. 
Затем число М - количество элементов во втором массиве. 
Затем элементы второго массива
Ввод:
Вывод:
7
3 1 3 4 2 4 12
6
4 15 43 1 15 1

### Решение 

### Код

```py
N=int(input("Введите кол-во элементов в первом массиве "))

list_1=list()
for i in range(N):
    list_1.append(int(input(f"Введите {i+1} элемент массива ")))

print(list_1)

M=int(input("Введите кол-во элементов во втором массиве "))

list_2=list()

for i in range(M):
    list_2.append(int(input(f"Введите {i+1} элемент массива ")))

print(list_2)

set_2=set(list_2)
res=list()
for elem in list_1:
    if elem not in set_2:
        res.append(elem)

print("Результат:", *res)  # выводим через пробел
```

## Задача № 2

Дан массив, состоящий из целых чисел. Напишите программу, 
которая в данном массиве определить количество элементов, 
у которых два соседних и, при этом, оба соседних элемента меньше данного. 
Сначала вводится число N - количество элементов в массиве
Далее записаны N чисел — элементы массива. Массив состоит из целых чисел.

### Решение 

### Код
```py
N = int(input("Введите кол-во элементов в массиве "))
list_1 = []
for i in range(N):
    list_1.append(int(input(f"Введите {i+1} элемент массива ")))

print(list_1)

count = 0
# Проверяем элементы со 2-го по предпоследний (индексы от 1 до N-2)
for i in range(1, N - 1):
    if list_1[i] > list_1[i-1] and list_1[i] > list_1[i+1]:
        count += 1

print(count)
```

## Задача 3

Дан список чисел. Посчитайте, сколько в нем пар элементов, равных друг другу. 
Считается, что любые два элемента, равные друг другу образуют одну пару, 
которую необходимо посчитать. Вводится список чисел. 
Все числа списка находятся на разных строках.

### Решение 

### Код
```py
N=int(input("Введите кол-во элементов в массиве N "))

list_1=list()

for i in range(N):
    list_1.append(int(input(f"Введите {i+1} элемента в массиве")))


# Подсчёт частоты каждого числа
freq = {}
for num in list_1:
    freq[num] = freq.get(num, 0) + 1

# Суммируем количество пар
total_pairs = 0
for count in freq.values():
    total_pairs += count * (count - 1) // 2

print(total_pairs)
```

## Задача 4

Два различных натуральных числа п и т называются дружественными, 
если сумма делителей числа п (включая 1, но исключая само п) 
равна числу т и наоборот. Например, 220 и 284 - дружественные числа.
По данному числу к выведите все пары дружественных чисел, 
каждое из которых не превосходит к. 
Программа получает на вход одно натуральное число к,
 не превосходящее 105. 
 Программа должна вывести все пары дружественных чисел, 
 каждое из которых не превосходит к. Пары необходимо выводить 
 по одной в строке, разделяя пробелами. Каждая пара должна 
 быть выведена только один раз (перестановка чисел новую пару не дает).

### Решение

### Код

```py
k = int(input())

# Массив для хранения суммы собственных делителей
sum_div = [0] * (k + 1)

# Решето: для каждого i добавляем i ко всем кратным числам, начиная с 2*i
for i in range(1, k + 1):
    for j in range(2 * i, k + 1, i):
        sum_div[j] += i

# Поиск дружественных пар
for n in range(1, k + 1):
    m = sum_div[n]
    # Проверяем, что m больше n (чтобы не дублировать) и не превышает k,
    # и что сумма делителей m равна n
    if m > n and m <= k and sum_div[m] == n:
        print(n, m)
```

# Домашняя работа 

## Задача  1

Задача 30: Заполните массив элементами арифметической прогрессии. 
Её первый элемент, разность и количество элементов нужно ввести с клавиатуры. 
Формула для получения п-го члена прогрессии: а. = а, + (n-1) * d.
Каждое число вводится с новой строки.

### Решение 

### Код

```py
n=int(input("Введите кол-во членов прогрессии "))
a1=int(input("Введите первый член прогрессии "))
d=int(input("Введите разность "))

list_1=[a1]

for i in range(2,n):
    list_1.append(a1+((i-1)*d))

print(list_1)
```

## Задача 2

Задача 32: Определить индексы элементов массива (списка),
 значения которых принадлежат заданному диапазону 
 (т.е. не меньше заданного минимума и не больше заданного максимума)

 Ввод: [-5, 9, 0, 3, - 1, - 2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, - 5, 7]
Вывод: [1, 9, 13, 14, 19]

### Решение 

### Код
```py
n=int(input("Кол-во элементов в массиве "))

list_1=list()

for i in range(n):
    list_1.append(int(input(f"Введите {i+1} элемента ")))

print(list_1)


min=int(input("Введите минимум "))
max=int(input("Введите максимум "))
res=list()

for i in range(len(list_1)):
    if (list_1[i]>min and list_1[i]<max):
        res.append(i)

print(res)
```
