# Семинар 4 
## Задание 1
Напишите программу, которая принимает на вход строку, и отслеживает, 
сколько раз каждый символ уже встречался. 
Количество повторов добавляется к символам с помощью постфикса формата _п.

### Решение 
### Код 
```py
string=input().split()
res={}

for i in string:
    if i in res:
        print(f'{i}_{res[i]}', end = ' ')
    else : 
        print(i, end=' ')
    res[i]=res.get(i,0)+1
```

## Задание 2
Пользователь вводит текст(строка). 
Словом считается последовательность непробельных символов 
идущих подряд, слова разделены одним или большим числом 
пробелов. Определите, сколько различных слов
содержится в этом тексте.

### Решение 
### Код
```py
string=input().lower().split()

a=set(string)

print(len(a))
```

## Задание 3
Ваня и Петя поспорили, кто быстрее решит следующую задачу: 
"Задана последовательность неотрицательных целых чисел. 
Требуется определить значение наибольшего элемента 
последовательности, 
которая завершается первым встретившимся нулем 
(число 0 не входит в последовательность)". 
Однако 2 друга оказались не такими смышлеными. 
Никто из ребят не смог до конца сделать это задание. 
Они решили так: у кого будет меньше ошибок в коде, 
тот и выиграл спор. За помощью товарищи обратились 
к Вам, студентам.

### Решение
### Код
```py
list_1=list()

k=int(input())

for i in range(k):
    list_1.append(int(input()))

print(list_1)
res=list()
for i in range (0, len(list_1)):
    if (list_1[i]!=0):
        res.append(list_1[i])
    else : 
        break

print(res)

max=res[0]

for i in range(1,len(res)):
    if (res[i]>max):
        max=res[i]

print(max)
```

# Домашняя работа
## Задача 1
Даны два неупорядоченных набора целых чисел 
(может быть, с повторениями). 
Выдать без повторений в порядке возрастания все те числа,
 которые встречаются в обоих наборах.
Пользователь вводит 2 числа. п - кол-во элементов 
первого множества. т - кол-во элементов второго множества.
 Затем пользователь водит сами элементы ножеств.

### Решение
### Код
```py
n=int(input("Введите кол-во элементов в первом массиве "))
m=int(input("Введите кол-во элементов в втором массиве "))

a=list()
b=list()

for i in range(n):
    a.append(int(input("Введите элемент первого массива ")))

for i in range(m):
    b.append(int(input("Введите эелмент второго массива ")))


print(a)
print(b)

a=set(a)
b=set(b)

c=a.union(b)

res=sorted(c)

print(res)
```

## Задание 2
В фермерском хозяйстве в Карелии выращивают чернику. 
Она растет на круглой грядке, причем кусты высажены 
только по окружности. 
Таким образом, у каждого куста есть ровно два соседних. 
Всего на грядке растет N кустов.
Эти кусты обладают разной урожайностью, 
поэтому ко времени сбора на них
выросло различное число ягод - на і-ом кусте вросло а. ягод.
В этом фермерском хозяйстве внедрена система 
автоматического сбора черники.
Эта система состоит из управляющего модуля 
и нескольких собирающих модулей.
Собирающий модуль за один заход, 
находясь непосредственно перед некоторым
кустом, собирает го стого куста ис двусосени с ним.
Напишите программу для нахождения максимального числа ягод, 
которое может собрать за один заход собирающий модуль, 
находясь перед некоторым кустом заданной 
во входном файле грядки.

### Решение
### Код
```py
# Чтение данных
n = int(input())
berries = list(map(int, input().split()))

# Поиск максимальной суммы для тройки соседних кустов (с учётом кольца)
max_harvest = 0
for i in range(n):
    # Индексы соседей: i-1 и i+1 с циклическим переходом
    left = (i - 1) % n
    right = (i + 1) % n
    current_sum = berries[i] + berries[left] + berries[right]
    if current_sum > max_harvest:
        max_harvest = current_sum

# Вывод результата
print(max_harvest)
```
