# Семинар №1. Ввод и вывод
## Задача 1 
### Условие 
За день машина проезжает n километров. 
Сколько дней нужно чтобы проехать 
m километров

### Решение
### Код
```py
n=int(input("Сколько километров в день проехала "))
m=int(input("Какая длинна маршрута "))
if (m % n ==0):
    print(int(m/n))
else : 
    print(int(m/n + 1))
```

## Задача 2 
### Условие 
Известно кол-во учащихся в кажом классе (всего их 3).
Минимальное кол-во парт которые нужны
### Решение
### Условие 
```py
first_class=int(input("Введите кол-во учащихся в первом классе"))
second_class=int(input("Введите кол-во учащихся в втором классе "))
third_class=int(input("Введите кол-во учащихся в третьем классе"))

desks_a = (first_class + 1) // 2
desks_b = (second_class + 1) // 2
desks_c = (third_class + 1) // 2

print(desks_a+desks_b+desks_c)
```

## Задача 3 
### Условие
Витя сел в i - вагон в вагоне 
обнаружил j вагон сколько всего вагонов
### Решение
### Код
```py
i=int(input())
j=int(input())

print(i-1+j)
```

## Задача 4
### Условие
Определение высокосного года
### Решение 
### Код
```py
year=int(input())

if (year % 4 ==0 and year%100 !=0 or year%400 == 0):
    print("true")
else : 
    print("fasle")
```
# Домашняя работа
## Задача 1
### Условие
В первый же день на сайте отвалилась формула по расчёту рекламной
метрики, и только Вася может её поправить. Часть программы с вводными
данными представлена ниже, отдельно записана формула на математическом
языке.
### Решение
### Код
```py
a = 8
b = 10
c = 12
d = 18

"""
((-3 + a^2)*b - 2^3)/c-2*d
"""
res = ((-3 + a**2) * b - 2**3) / (c - 2 * d)

print(res)
```

## Задача 2
### Условие
Напишите программу , которая получает на вход число n (количество минут),
затем считает , сколько это будет в часах и сколько минут останется, и выводит
на экран эти два результата.
### Решение
### Код
```py
n = int(input())
hours = (n // 60) % 24
minutes = n % 60
print(hours)
print(minutes)
```

## Задача 3
### Условие
Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за
проезд и получали билет с номером.
Счастливым билетом называют такой билет с шестизначным номером, где
сумма первых трех цифр равна сумме последних трех.
Т .е. билет с номером 385916 – счастливый, т .к. 3+8+5=9+1+6.
Вам требуется написать программу , которая проверяет счастливость билета с
номером n и выводит на экран yes или no.

### Решение 
### Код
```py
n = input()
if len(n) != 6:
    print("no")  # или можно считать, что билет не шестизначный - не счастливый
else:
    first = 0
    second = 0
    for i in range(3):
        first += int(n[i])
    for i in range(3, 6):
        second += int(n[i])
    if first == second:
        print("yes")
    else:
        print("no")
```
