# Семинар № 5. Функции и рекурсии 

## Задание 1

Последовательностью Фибоначчи
последовательность чисел а
1'.••, a
n' ..., ГДе
a =0, a, = 1, a, = ak1 + 2k2 (k> 1).
Требуется найти N-e число Фибоначчи

### Решение

### Код 
```py
def find_fib_index(x):
    if x < 0:
        return None  # или ошибка
    if x == 0:
        return 1
    if x == 1:
        return 2
    a, b = 0, 1
    index = 2  # текущий индекс для b (a1=0, a2=1)
    while b < x:
        a, b = b, a + b
        index += 1
        if b == x:
            return index
    # если вышли из цикла, значит b > x, и число не найдено
    return None  # или можно выбросить исключение

x = int(input("Введите число Фибоначчи: "))
res = find_fib_index(x)
if res is None:
    print("Введённое число не является членом последовательности Фибоначчи (с a1=0, a2=1)")
else:
    print(f"Номер этого члена: {res}")

```

## Задание 2

Хакер Василий получил доступ к классному журналу и
хочет заменить все свои минимальные оценки на
максимале. Напишете программу,
заменяет оценки Василия, но наоборот: максимальные - на минимальные.

### Решение 

### Код 
```py
n=int(input())

list_1=list()
for i in range(n):
    list_1.append(int(input()))

max_n=max(list_1)
min_n=min(list_1)

for i in range(len(list_1)):
    if list_1[i]==max_n:
        list_1[i]=min_n

print(list_1)
```

## Задание 3 

Задача Nº35. Решение задачи
Напишите функцию, которая принимает одно число и проверяет, является ли оно простым
Напоминание: Простое число - это число, которое имеет 2 делителя: 1 и п(само число)

### Решение 

### Код 
```py
def boolprost(n):
    i=2
    while i<n-1:
        if (n%i==0):
            return "no"
        else : 
            return "yes"
    i+=1

a=boolprost(5)
print(a)
```

## Задание 4
Дано натуральное число N и последовательность из N элементов.
Требуется вывести эту последовательность в обратном порядке.
Примечание. В программе запрещается объявлять массивы 
и использовать циклы (даже для ввода и вывода).

### Решение 

### Код
```py
def reverse_input(n):
    """Рекурсивно читает n чисел и выводит их в обратном порядке."""
    if n == 0:
        return
    x = int(input())          # читаем текущее число
    reverse_input(n - 1)      # рекурсивно читаем и выводим остальные
    print(x, end=' ' if n > 1 else '')  # выводим после возврата из рекурсии

n = int(input())              # количество элементов
reverse_input(n)
```

# Домашняя работа 

## Задание 1

Задача 26: Напишите программу, которая на вход принимает два числа А и В, 
и возводит число А в целую степень В с помощью рекурсии.

### Решение 

### Код
```py
def power(a: float, b: int) -> float:
    """
    Рекурсивно возводит число a в целую степень b.
    Поддерживает отрицательные показатели степени.
    """
    if b == 0:
        return 1
    elif b > 0:
        return a * power(a, b - 1)
    else:  # b < 0
        return 1 / power(a, -b)
    


a = float(input("Введите основание A: "))
b = int(input("Введите показатель степени B (целое число): "))
result = power(a, b)
print(f"{a} в степени {b} = {result}")
```

## Задание 2

Напишите рекурсивную функцию sum(a, b), 
возвращающую сумму двух целых неотрицательных чисел. 
Из всех арифметических операций допускаются только +1 и -1.
Также нельзя использовать циклы.

### Решение 

### Код

```py
def sum(a: int, b: int) -> int:
    """
    Возвращает сумму a и b, используя только +1 и -1.
    Предполагается, что a и b — целые неотрицательные числа.
    """
    if b == 0:
        return a
    # Уменьшаем b на 1, увеличиваем a на 1 — рекурсивно приближаемся к базовому случаю
    return sum(a + 1, b - 1)

# Пример использования

a = int(input("Введите первое неотрицательное число A: "))
b = int(input("Введите второе неотрицательное число B: "))
result = sum(a, b)
print(f"Сумма {a} + {b} = {result}")
```

