# Семинар №2. Циклы
## Задача 1
### Условие
По данному целому неотрицательному п вычислите значение п!. N! = 1* 2* 3 * ... * N 
(произведение всех чисел от 1 до N) 0! = 1 Решить задачу используя цикл
while
### Решение
### Код
```py
N=int(input("Введите число факториала  "))
result=1
i=1
while i<=N:
    result *=i
    i+=1
print(result)
```

## Задача 2
### Условие 
Дано натуральное число А > 1. 
Определите, каким по счету числом Фибоначчи оно является, 
то есть выведите такое число п, что (n)=А. 
Если А не является числом Фибоначчи, выведите число -1.
### Решение 
### Код
```py
# 0 1 1 2 3 5 8 13 
n=int(input())
n0=0
n1=0
n2=1
i=2
while n0<n:
    n0=n1+n2
    n1=n2
    n2=n0
    i+=1
    if (n0>n):
        print(-1)
print(i)
```

## Задача 3 
### Условие
Уставшие от необычно теплой зимы, жители решили узнать, 
действительно ли это самая длинная оттепель за всю историю наблюдений за погодой. 
Они обратились к синоптикам, а те, в свою очередь, 
занялись исследованиями статистики за прошлые годы. 
Их интересует, сколько дней длилась самая длинная оттепель. 
Оттепелью они называют период, 
в который среднесуточная температура ежедневно превышала 0 градусов Цельсия. 
Напишите программу, помогающую синоптикам в работе.
Пользователь вводит число N - общее количество рассматриваемых дней (1 ≤ N ≤ 100). 
В следующих строках располагается N целых чисел.
Каждое число - среднесуточная температура в соответствующий день. 
Температуры - целые числа и лежат в диапазоне от -50 до 50
### Решение
### Код
```py
N=int(input())
max=0
k=0
for i in range(N):
    x=int(input())
    if (x>0):
        k+=1
    else :
        if(max<k):
            max=k
            k=0
print(max)
```

## Задача 4
### Условие
Иван Васильевич пришел на рынок и решил купить два арбуза: 
один для себя, а другой для тещи.
Понятно, что для себя нужно выбрать арбуз потяжелей, а для тещи полегче. 
Но вот незадача: арбузов слишком много и он не знает как же 
выбрать самый легкий и самый тяжелый арбуз? Помогите ему!
Пользователь вводит одно число N - количество арбузов. 
Вторая строка содержит N чисел, записанных на новой строчке каждое. 
Здесь каждое число - это масса соответствующего арбуза. 
Все числа натуральные и не превышают 3000
### Решение
### Код
```py
N=int(input())
max=-1
min=30001
for i in range(N):
    x=int(input())
    if(x>max):
        max=x
    if(x<min):
        min=x

print(max, min)
```

# Домашняя работа
## Задача 1
### Условие
Задача 10: На столе лежат п монеток. 
Некоторые из них лежат вверх решкой, а некоторые - гербом. 
Определите минимальное число монеток, которые нужно перевернуть, 
чтобы все монетки были повернуты вверх одной и той же стороной. 
Выведите минимальное количество монет, которые нужно перевернуть.
### Решение
### Код
```py
N=int(input())
k=0
l=0
max=0
for i in range(N):
    x=int(input())
    if(x==1):
        k+=1
    else :
        l+=1
if (k>l):
    print(l)
else : 
    print(k)
```
## Задача 2
### Условие
Задача 12: Петя и Катя - брат и сестра. Петя - студент, а Катя - школьница. 
Петя помогает Кате по математике. Он задумывает два натуральных числа 
Х и Y (X,Y≤1000), 
а Катя должна их отгадать. Для этого Петя делает две подсказки. 
Он называет сумму этих чисел S и их произведение Р. 
Помогите Кате отгадать задуманные Петей числа.
### Решение
### Код
```py
import math
S = int(input("Введите сумму S: "))
P = int(input("Введите произведение P: "))
    
discriminant = S*S - 4*P
if discriminant < 0:
    print("Нет действительных решений")
else : 
    sqrt_disc = int(math.isqrt(discriminant))
    if sqrt_disc * sqrt_disc != discriminant:
        print("Нет целочисленных решений")
    else:
# Проверяем, что (S ± sqrt_disc) четное
        x1 = (S + sqrt_disc) // 2
        x2 = (S - sqrt_disc) // 2
        print(x1,x2)
```
## Задача 3
### Условеи
Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2*),
 не превосходящие числа N.
### Решение
### Код
```py
N=int(input())
res = 1
while res<N:
    print(res)
    res*=2
```